package day30;

public class KioskMain {
/*제품을 관리하는 프로그램을 작성하세요.
 * -구매가격, 판매가격은 변동이 없음
 * 기능
 * - 제품 등록(분류, 제품명, 수량,구매가격, 판매가격)
 * - 제품 수정
 * - 제품 삭제
 * - 제품 구매
 * - 제품 판매
 * - 매출액 확인
 *  - 년별
 *  	- 제품별
 *  	- 전체
 *  - 월별
 *  	- 제품별
 *  	- 전체
 *  - 일별
 *  	- 제품별
 *  	- 전체
 *
 *  
 * */

	public static void main(String[] args) {
		
		//메뉴 출력
		//메뉴 번호 입력
		//메뉴 실행
		 // 제품 등록 메뉴의 경우 
			// 분류, 제품명, 수량,구매가격, 판매가격을 입력하라는 안내
				// 분류의 경우 -> 빵/과자/아이스크림/음료수 중 입력하게 함
			// 입력
			// 분류대로 리스트를 저장
		// 제품 수정 메뉴의 경우
			// 분류와 제품명을 입력하라는 안내
			// 분류와 제품명을 입력
			// 리스트에서 일치하는 내역을 반환
			// 분류, 제품명, 수량을 수정
		// 제품 삭제 메뉴의 경우
			// 분류와 제품명을 입력하라는 안내
			// 분류와 제품명을 입력
			// 리스트에서 일치하는 내역을 반환
			// 리스트 삭제
		// 제품 구매의 경우
			// 분류를 선택하라는 출력창
			// 분류 선택
			// 분류에 관한 리스트 전체 출력
			// 리스트가 출력되면 리스트 번호를 입력
			// 구매할 수량 안내
			// 구매할 수량 입력
		
		
		
	}

}
